In [42]:
import pandas as pd
import numpy as np

np.random.seed(123)

### Exercises I

1. Run `python -m pip install pymysql` from your terminal to install pymysql.

2. `cd` into your exercises folder for this module and run `echo env.py >> .gitignore`

In [43]:
# 3. Create a function named `get_db_url`. It should accept a username,
#     hostname, password, and database name and return a url connection
#     string formatted like in the example at the start of this lesson.
from env import host, user, pwd

def get_db_url(host, user, pwd, db):
    return f'mysql+pymysql://{user}:{pwd}@{host}/{db}'

In [44]:
# 4. Use your function to obtain a connection to the `employees` database.
url = get_db_url(host, user, pwd, 'employees')

In [45]:
# 5. Once you have successfully run a query:

#     a. Intentionally make a typo in the database url.
#     What kind of error message do you see?

# *Operational Error, Access Denied for user*

sql = 'SELECT * FROM employees LIMIT 100'

pd.read_sql(sql, get_db_url(host, user, pwd, 'employes'))

OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'quintela_2238'@'%' to database 'employes'")
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [ ]:
#     b. Intentionally make an error in your SQL query.
#     What does the error message look like?

# ProgrammingError, SQL error is given (e.g. syntax, table doesn't exist, etc.)

sql_w_typo = 'SELECT * FROM employees LIMI 100'

pd.read_sql(sql_w_typo, get_db_url(host, user, pwd, 'employees'))

In [ ]:
# 6. Read the `employees` and `titles` tables into two separate DataFrames.
sql_e = 'SELECT * FROM employees'
employees_df = pd.read_sql(sql_e, get_db_url( host, user, pwd, 'employees') )
employees_df

In [ ]:
sql_t = 'SELECT * FROM titles'
titles_df = pd.read_sql(sql_t, get_db_url( host, user, pwd, 'employees') )
titles_df

In [ ]:
# 7. How many rows and columns do you have in each DataFrame? Is that what you expected?
print(employees_df.shape)
print(titles_df.shape)

In [ ]:
# 8. Display the summary statistics for each DataFrame.
employees_df.describe()

In [ ]:
titles_df.describe()

In [ ]:
# 9. How many unique titles are in the `titles` DataFrame?
titles_df['title'].unique()

In [46]:
# 10. What is the oldest date in the `to_date` column?
titles_df['to_date'].min()

datetime.date(1985, 3, 1)

In [47]:
titles_df[ titles_df['to_date'] == titles_df['to_date'].min() ]

       emp_no     title   from_date     to_date
16064   20869  Engineer  1985-02-17  1985-03-01

In [48]:
# 11. What is the most recent date in the `to_date` column?
#     assume not current (i.e. to_date == '9999%')
#     otherwist that would be our most recent days
import datetime

# remove current titles
title_df_not_current = titles_df[ titles_df['to_date'] !=  datetime.date(9999, 1, 1) ]

# most recent date
title_df_not_current['to_date'].max()

datetime.date(2002, 8, 1)

In [49]:
# filter titles_df to show where to_date ==
#     most recent date (i.e. title_df_not_current['to_date'].max())
titles_df[ titles_df['to_date'] == title_df_not_current['to_date'].max()]

        emp_no               title   from_date     to_date
15192    20278        Senior Staff  1999-11-04  2002-08-01
17375    21763               Staff  1994-08-01  2002-08-01
23636    26000               Staff  1997-08-01  2002-08-01
67905    55876               Staff  1995-08-01  2002-08-01
80193    64174            Engineer  1996-08-01  2002-08-01
116306   88539               Staff  1995-08-01  2002-08-01
118697   90134               Staff  1994-08-01  2002-08-01
119478   90666            Engineer  1997-08-01  2002-08-01
128288   96599            Engineer  1994-08-01  2002-08-01
135654  101563               Staff  1997-08-01  2002-08-01
143273  106707               Staff  1997-08-01  2002-08-01
147796  109776               Staff  1998-05-28  2002-08-01
154568  204324    Technique Leader  1985-02-10  2002-08-01
154942  204587            Engineer  1996-08-01  2002-08-01
158107  206731            Engineer  1996-08-01  2002-08-01
164220  210868            Engineer  1993-08-01  2002-08-01
177341  219722  Assistant Engineer  1997-08-01  2002-08-01
197364  233339            Engineer  1996-08-01  2002-08-01
197394  233358               Staff  1994-08-01  2002-08-01
203061  237207            Engineer  1993-08-01  2002-08-01
209212  241410     Senior Engineer  2001-04-20  2002-08-01
209437  241571     Senior Engineer  1990-01-05  2002-08-01
235813  259430            Engineer  1993-08-01  2002-08-01
251244  269877        Senior Staff  1997-11-04  2002-08-01
261372  276731     Senior Engineer  1998-01-09  2002-08-01
280179  289500               Staff  1995-08-01  2002-08-01
291839  297339               Staff  1993-08-01  2002-08-01
304108  405703            Engineer  1994-08-01  2002-08-01
308446  408664               Staff  1994-08-01  2002-08-01
319569  416185               Staff  1999-10-28  2002-08-01
320376  416723  Assistant Engineer  1994-08-01  2002-08-01
339121  429386        Senior Staff  1990-02-03  2002-08-01
364701  446732     Senior Engineer  1992-11-10  2002-08-01
365960  447596               Staff  1996-08-01  2002-08-01
366762  448129        Senior Staff  2001-01-23  2002-08-01
373713  452819            Engineer  1993-08-01  2002-08-01
387242  461960               Staff  1997-08-01  2002-08-01
391712  464962     Senior Engineer  2001-02-23  2002-08-01
399465  470224        Senior Staff  1999-08-08  2002-08-01
436756  495525               Staff  1996-08-01  2002-08-01

### Exercises II

In [50]:
# 1. Copy the `users` and `roles` DataFrames from the examples above.
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})

In [51]:
# 2. What is the result of using a `right` join on the DataFrames?
users.merge(roles, left_on = 'role_id', right_on = 'id', how = 'right')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [52]:
# 3. What is the result of using an `outer` join on the DataFrames?
users.merge(roles, left_on = 'role_id', right_on = 'id', how = 'outer')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [53]:
# 4. What happens if you drop the foreign keys from the 
#     DataFrames and try to merge them?

# users.drop('role_id', axis=1).merge(roles)

# There won't be columns to merge.. ?.. outside of 'id's' but
# we'd be matching different id's

In [54]:
# 5. Load the `mpg` dataset from PyDataset.
from pydataset import data
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [ ]:
# 6. Output and read the documentation for the `mpg` dataset.
data('mpg', show_doc=True)

In [55]:
# 7. How many rows and columns are in the dataset?
# 234 rows and 11 variables
mpg.shape

(234, 11)

In [ ]:
# 8. Check out your column names and perform any
#     cleanup you may want on them.
mpg.columns

In [ ]:
mpg = mpg.rename(columns = {'displ':'display','fl':'fuel'})
mpg.head(2)

In [56]:
# 9. Display the summary statistics for the dataset.
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [57]:
# 10. How many different manufacturers are there?
print(list(mpg.manufacturer.unique()))
len(mpg.manufacturer.unique())

['audi', 'chevrolet', 'dodge', 'ford', 'honda', 'hyundai', 'jeep', 'land rover', 'lincoln', 'mercury', 'nissan', 'pontiac', 'subaru', 'toyota', 'volkswagen']

15

In [ ]:
# 11. How many different models are there?
print(list(mpg.model.unique()))
len(mpg.model.unique())

In [58]:
# 12. Create a column named `mileage_difference` like you did in 
#     the DataFrames exercises; this column should contain
#     the difference between highway and city mileage for each car.
mpg['mileage_difference'] = mpg['hwy'] - mpg['cty'] 
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

In [59]:
# 13. Create a column named `average_mileage`
#     like you did in the DataFrames exercises; 
#     this is the mean of the city and highway mileage.
mpg['average_mileage'] = (mpg['hwy'] + mpg['cty']) / 2
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0

In [60]:
# 14. Create a new column on the mpg dataset named
#     `is_automatic` that holds boolean values denoting whether
#     the car has an automatic transmission.
mpg['is_automatic'] = mpg['trans'].str.find('auto') >= 0
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True

In [61]:
# 15. Using the `mpg` dataset, find out which manufacturer
#     has the best miles per gallon on average?
mpg.groupby('manufacturer').average_mileage \
                            .mean() \
                            .sort_values(ascending=False).head(1)

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

In [62]:
# 16. Do automatic or manual cars have better miles per gallon?
mpg.groupby('is_automatic').average_mileage \
                            .mean()
# manual has better mpg

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64

### Exercises III

In [72]:
# 1. Use your `get_db_url` function to help you explore the data
#     from the `chipotle` database.
chip_url = get_db_url(host, user, pwd, 'chipotle')
sql = 'SELECT * FROM orders'
orders = pd.read_sql(sql, chip_url)
orders.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

If cell below is run twice, an error will be produced. Just run the above on to reload the dataset

In [73]:
# 2. What is the total price for each order?
# convert price to float
orders['item_price'] = orders['item_price'].str[1:].astype(float)
orders.head(8)

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39
1,2,1,1,Izze,[Clementine],3.39
2,3,1,1,Nantucket Nectar,[Apple],3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",16.98
5,6,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sour Cream, Guacamole, Lettuce]]",10.98
6,7,3,1,Side of Chips,nan,1.69
7,8,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables, Black Beans, Pinto Beans, Cheese, Sour...",11.75

Seeing if `item_price` is price for only one `item_name`

In [74]:
orders.sort_values(by= 'quantity', ascending=False).head()

,id,order_id,quantity,item_name,choice_description,item_price
3598,3599,1443,15,Chips and Fresh Tomato Salsa,nan,44.25
4152,4153,1660,10,Bottled Water,nan,15.00
3887,3888,1559,8,Side of Chips,nan,13.52
3599,3600,1443,7,Bottled Water,nan,10.50
2441,2442,970,5,Bottled Water,nan,7.50

`item_price` only represents price for one `item_name`. So before I group by `order_id`, I want to create a `total_item_price` column that is `quantity * item_price` and sum that column rather than `item_price`

In [76]:
orders['total_item_price'] = orders['quantity'] * orders['item_price']
orders.head(5)

,id,order_id,quantity,item_name,choice_description,item_price,total_item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39,2.39
1,2,1,1,Izze,[Clementine],3.39,3.39
2,3,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",16.98,33.96

In [40]:
total_per_order = orders.groupby('order_id').item_price.sum()
total_per_order.head()

order_id
1    11.56
2    16.98
3    12.67
4    21.00
5    13.70
Name: item_price, dtype: float64

In [ ]:
# 3. What are the most popular 3 items?

In [ ]:
# 4. Which item has produced the most revenue?

In [78]:
# 5. Join the `employees` and `titles` DataFrames together.
emp_url = get_db_url(host, user, pwd, 'employees')
emp_sql = 'SELECT * FROM employees'
employees = pd.read_sql(emp_sql, emp_url)
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [79]:
titles_sql = 'SELECT * FROM titles'
titles = pd.read_sql(titles_sql, emp_url)
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

Assuming inner join

In [89]:
e_t_df = employees.merge(titles, how='inner',
                left_on='emp_no', right_on='emp_no')
e_t_df.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01

In [90]:
# 6. For each title, find the hire date of the employee that
#     was hired most recently with that title.

a. Dropping rows where from_date doesn't math hire_date because these aren't the titles the employees were hired with

In [96]:
condition = e_t_df['hire_date'] == e_t_df['from_date']

e_t_df = e_t_df[condition]

e_t_df.head(3)

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
6,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,Staff,1989-09-12,1996-09-12

b. Grouping by title to see most recent hire date

In [104]:
mrhd_by_title = e_t_df.groupby('title').hire_date.max()
mrhd_by_title

title
Assistant Engineer    1999-12-12
Engineer              2000-01-23
Manager               1985-01-01
Senior Engineer       2000-01-01
Senior Staff          2000-01-06
Staff                 2000-01-02
Technique Leader      1999-12-15
Name: hire_date, dtype: object

c. inner joining these dates to match the employee info

In [106]:
e_t_df[e_t_df[['title','hire_date'] == mrhd_by_title]]

ValueError: ('Lengths must match to compare', (7,), (2,))

In [ ]:
# 7. Write the code necessary to create a cross tabulation of
#     the number of titles by department. (Hint: this will
#     involve a combination of SQL code to pull the necessary
#     data and python/pandas code to perform the manipulations.)